Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG01/atdf/PIC32CK0512SG01064.atdf
          <generator name="TCC2_MC_5" index="76" module-instance="TCC2"/>
          <generator name="TCC3_OVF" index="77" module-instance="TCC3"/>
          <generator name="TCC3_TRG" index="78" module-instance="TCC3"/>
          <generator name="TCC3_CNT" index="79" module-instance="TCC3"/>
          <generator name="TCC3_MC_0" index="80" module-instance="TCC3"/>
          <generator name="TCC3_MC_1" index="81" module-instance="TCC3"/>
          <generator name="TCC3_MC_2" index="82" module-instance="TCC3"/>
          <generator name="TCC3_MC_3" index="83" module-instance="TCC3"/>
          <generator name="TCC3_MC_4" index="84" module-instance="TCC3"/>
          <generator name="TCC3_MC_5" index="85" module-instance="TCC3"/>
          <generator name="TCC4_OVF" index="86" module-instance="TCC4"/>
          <generator name="TCC4_TRG" index="87" module-instance="TCC4"/>
          <generator name="TCC4_CNT" index="88" module-instance="TCC4"/>
          <generator name="TCC4_MC_0" index="89" module-instance="TCC4"/>
          <generator name="TCC4_MC_1" index="90" module-instance="TCC4"/>
          <generator name="TCC5_OVF" index="91" module-instance="TCC5"/>
          <generator name="TCC5_TRG" index="92" module-instance="TCC5"/>
          <generator name="TCC5_CNT" index="93" module-instance="TCC5"/>
          <generator name="TCC5_MC_0" index="94" module-instance="TCC5"/>
          <generator name="TCC5_MC_1" index="95" module-instance="TCC5"/>
          <generator name="TCC6_OVF" index="96" module-instance="TCC6"/>
          <generator name="TCC6_TRG" index="97" module-instance="TCC6"/>
          <generator name="TCC6_CNT" index="98" module-instance="TCC6"/>
          <generator name="TCC6_MC_0" index="99" module-instance="TCC6"/>
          <generator name="TCC6_MC_1" index="100" module-instance="TCC6"/>
          <generator name="TCC7_OVF" index="101" module-instance="TCC7"/>
          <generator name="TCC7_TRG" index="102" module-instance="TCC7"/>
          <generator name="TCC7_CNT" index="103" module-instance="TCC7"/>
          <generator name="TCC7_MC_0" index="104" module-instance="TCC7"/>
          <generator name="TCC7_MC_1" index="105" module-instance="TCC7"/>
          <generator name="ADC_CHRDYC_0" index="106" module-instance="ADC"/>
          <generator name="ADC_CMP_0" index="107" module-instance="ADC"/>
          <generator name="AC_COMP_0" index="108" module-instance="AC"/>
          <generator name="AC_COMP_1" index="109" module-instance="AC"/>
          <generator name="AC_WIN_0" index="110" module-instance="AC"/>
          <generator name="SPI_IXS_GEN" index="113" module-instance="SPI"/>
          <generator name="CCL_LUTOUT_0" index="114" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_1" index="115" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_2" index="116" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_3" index="117" module-instance="CCL"/>
          <generator name="PDEC_DIR" index="118" module-instance="PDEC"/>
          <generator name="PDEC_ERR" index="119" module-instance="PDEC"/>
          <generator name="PDEC_MC_0" index="120" module-instance="PDEC"/>
          <generator name="PDEC_MC_1" index="121" module-instance="PDEC"/>
          <generator name="PDEC_OVF" index="122" module-instance="PDEC"/>
          <generator name="PDEC_VLC" index="123" module-instance="PDEC"/>
          <generator name="ETH_TSU_CMP" index="124" module-instance="ETH"/>
          <generator name="TRNG_READY" index="125" module-instance="TRNG"/>
        </generators>
        <users>
          <user name="FREQM_START" index="0" module-instance="FREQM"/>
          <user name="RTC_TAMPER" index="1" module-instance="RTC"/>
          <user name="PORT_EV_0" index="2" module-instance="PORT"/>
          <user name="PORT_EV_1" index="3" module-instance="PORT"/>
          <user name="PORT_EV_2" index="4" module-instance="PORT"/>
          <user name="PORT_EV_3" index="5" module-instance="PORT"/>
          <user name="DMA0_CHSTRT_0" index="6" module-instance="DMA0"/>
          <user name="DMA0_CHSTRT_1" index="7" module-instance="DMA0"/>
          <user name="DMA0_CHSTRT_2" index="8" module-instance="DMA0"/>
          <user name="DMA0_CHSTRT_3" index="9" module-instance="DMA0"/>
          <user name="DMA0_CHSTRT_4" index="10" module-instance="DMA0"/>
          <user name="DMA0_CHSTRT_5" index="11" module-instance="DMA0"/>
          <user name="DMA0_CHSTRT_6" index="12" module-instance="DMA0"/>
          <user name="DMA0_CHSTRT_7" index="13" module-instance="DMA0"/>
          <user name="DMA0_CHAUX_0" index="14" module-instance="DMA0"/>
          <user name="DMA0_CHAUX_1" index="15" module-instance="DMA0"/>
          <user name="DMA0_CHAUX_2" index="16" module-instance="DMA0"/>
          <user name="DMA0_CHAUX_3" index="17" module-instance="DMA0"/>
          <user name="DMA0_CHAUX_4" index="18" module-instance="DMA0"/>
          <user name="DMA0_CHAUX_5" index="19" module-instance="DMA0"/>
          <user name="DMA0_CHAUX_6" index="20" module-instance="DMA0"/>
          <user name="DMA0_CHAUX_7" index="21" module-instance="DMA0"/>
          <user name="DMA1_CHSTRT_0" index="22" module-instance="DMA1"/>
          <user name="DMA1_CHSTRT_1" index="23" module-instance="DMA1"/>
          <user name="DMA1_CHSTRT_2" index="24" module-instance="DMA1"/>
          <user name="DMA1_CHSTRT_3" index="25" module-instance="DMA1"/>
          <user name="DMA1_CHAUX_0" index="26" module-instance="DMA1"/>
          <user name="DMA1_CHAUX_1" index="27" module-instance="DMA1"/>
          <user name="DMA1_CHAUX_2" index="28" module-instance="DMA1"/>
          <user name="DMA1_CHAUX_3" index="29" module-instance="DMA1"/>
          <user name="TCC0_EV_0" index="30" module-instance="TCC0"/>
          <user name="TCC0_EV_1" index="31" module-instance="TCC0"/>
          <user name="TCC0_MC_0" index="32" module-instance="TCC0"/>
          <user name="TCC0_MC_1" index="33" module-instance="TCC0"/>
          <user name="TCC0_MC_2" index="34" module-instance="TCC0"/>
          <user name="TCC0_MC_3" index="35" module-instance="TCC0"/>
          <user name="TCC0_MC_4" index="36" module-instance="TCC0"/>
          <user name="TCC0_MC_5" index="37" module-instance="TCC0"/>
          <user name="TCC1_EV_0" index="38" module-instance="TCC1"/>
          <user name="TCC1_EV_1" index="39" module-instance="TCC1"/>
          <user name="TCC1_MC_0" index="40" module-instance="TCC1"/>
          <user name="TCC1_MC_1" index="41" module-instance="TCC1"/>
          <user name="TCC1_MC_2" index="42" module-instance="TCC1"/>
          <user name="TCC1_MC_3" index="43" module-instance="TCC1"/>
          <user name="TCC1_MC_4" index="44" module-instance="TCC1"/>
          <user name="TCC1_MC_5" index="45" module-instance="TCC1"/>
          <user name="TCC2_EV_0" index="46" module-instance="TCC2"/>
          <user name="TCC2_EV_1" index="47" module-instance="TCC2"/>
          <user name="TCC2_MC_0" index="48" module-instance="TCC2"/>
          <user name="TCC2_MC_1" index="49" module-instance="TCC2"/>
          <user name="TCC2_MC_2" index="50" module-instance="TCC2"/>
          <user name="TCC2_MC_3" index="51" module-instance="TCC2"/>
          <user name="TCC2_MC_4" index="52" module-instance="TCC2"/>
          <user name="TCC2_MC_5" index="53" module-instance="TCC2"/>
          <user name="TCC3_EV_0" index="54" module-instance="TCC3"/>
          <user name="TCC3_EV_1" index="55" module-instance="TCC3"/>
          <user name="TCC3_MC_0" index="56" module-instance="TCC3"/>
          <user name="TCC3_MC_1" index="57" module-instance="TCC3"/>
          <user name="TCC3_MC_2" index="58" module-instance="TCC3"/>
          <user name="TCC3_MC_3" index="59" module-instance="TCC3"/>
          <user name="TCC3_MC_4" index="60" module-instance="TCC3"/>
          <user name="TCC3_MC_5" index="61" module-instance="TCC3"/>
          <user name="TCC4_EV_0" index="62" module-instance="TCC4"/>
          <user name="TCC4_EV_1" index="63" module-instance="TCC4"/>
          <user name="TCC4_MC_0" index="64" module-instance="TCC4"/>
          <user name="TCC4_MC_1" index="65" module-instance="TCC4"/>
          <user name="TCC5_EV_0" index="66" module-instance="TCC5"/>
          <user name="TCC5_EV_1" index="67" module-instance="TCC5"/>
          <user name="TCC5_MC_0" index="68" module-instance="TCC5"/>
          <user name="TCC5_MC_1" index="69" module-instance="TCC5"/>
          <user name="TCC6_EV_0" index="70" module-instance="TCC6"/>
          <user name="TCC6_EV_1" index="71" module-instance="TCC6"/>
          <user name="TCC6_MC_0" index="72" module-instance="TCC6"/>
          <user name="TCC6_MC_1" index="73" module-instance="TCC6"/>
          <user name="TCC7_EV_0" index="74" module-instance="TCC7"/>
          <user name="TCC7_EV_1" index="75" module-instance="TCC7"/>
          <user name="TCC7_MC_0" index="76" module-instance="TCC7"/>
          <user name="TCC7_MC_1" index="77" module-instance="TCC7"/>
          <user name="ADC_TRIGGERS_0" index="78" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_1" index="79" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_2" index="80" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_3" index="81" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_4" index="82" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_5" index="83" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_6" index="84" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_7" index="85" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_8" index="86" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_9" index="87" module-instance="ADC"/>
          <user name="ADC_TRIGGERS_10" index="88" module-instance="ADC"/>
          <user name="AC_SOC_0" index="89" module-instance="AC"/>
          <user name="AC_SOC_1" index="90" module-instance="AC"/>
          <user name="CCL_LUTIN_0" index="93" module-instance="CCL"/>
          <user name="CCL_LUTIN_1" index="94" module-instance="CCL"/>
          <user name="CCL_LUTIN_2" index="95" module-instance="CCL"/>
          <user name="CCL_LUTIN_3" index="96" module-instance="CCL"/>
          <user name="PDEC_EVU_0" index="97" module-instance="PDEC"/>
          <user name="PDEC_EVU_1" index="98" module-instance="PDEC"/>
          <user name="PDEC_EVU_2" index="99" module-instance="PDEC"/>
          <user name="HSM_TAMPER_0" index="100" module-instance="HSM"/>
          <user name="HSM_TAMPER_1" index="101" module-instance="HSM"/>
          <user name="HSM_TAMPER_2" index="102" module-instance="HSM"/>
          <user name="HSM_TAMPER_3" index="103" module-instance="HSM"/>
        </users>
      </events>
      <interfaces>
        <interface name="JTAG" type="samjtag"/>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x09534053"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="03784" name2="cmp_ac_u2501_v2" version="2a0" caption="Analog Comparator Controller">
      <register-group name="AC" caption="Analog Comparator Controller">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
          <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
        </register>
        <register name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Control C">
          <bitfield name="WIDTH" caption="Sample and Hold Clock Pulse Width" mask="0x3FF"/>
          <bitfield name="PER" caption="Sample and Hold Clock Period" mask="0x3FF000"/>
          <bitfield name="PRESCALER" caption="Prescaling Factor" mask="0x7000000" values="CTRLC__PRESCALER"/>
          <bitfield name="AIPMPEN" caption="Analog Input Charge Pump Enable" mask="0x8000000"/>
          <bitfield name="CONFIG" caption="Configuration Extension" mask="0xF0000000"/>
        </register>
        <register name="EVCTRL" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1"/>
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2"/>
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x100"/>
          <bitfield name="COMPEI0" caption="Comparator 0 Event Input Enable" mask="0x10000"/>
          <bitfield name="COMPEI1" caption="Comparator 1 Event Input Enable" mask="0x20000"/>
          <bitfield name="INVEI0" caption="Inverted Event Input Enable 0" mask="0x1000000"/>
          <bitfield name="INVEI1" caption="Inverted Event Input Enable 1" mask="0x2000000"/>
        </register>
        <register name="INTENCLR" offset="0x10" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x100"/>
        </register>
        <register name="INTENSET" offset="0x14" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x100"/>
        </register>
        <register name="INTFLAG" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="COMP0" caption="Comparator 0" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0" mask="0x100"/>
        </register>
        <register name="STATUSA" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="Status A">
          <bitfield name="STATE0" caption="Comparator 0 Current State" mask="0x1"/>
          <bitfield name="STATE1" caption="Comparator 1 Current State" mask="0x2"/>
          <bitfield name="WSTATE0" caption="Window 0 Current State" mask="0x30000" values="STATUSA__WSTATE"/>
        </register>
        <register name="STATUSB" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Status B">
          <bitfield name="READY0" caption="Comparator 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="Comparator 1 Ready" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
