Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG01/atdf/PIC32CK0512SG01064.atdf
      <value-group name="CTRLB__BLANK">
        <value name="BLANK0" caption="No blank delay" value="0x00000"/>
        <value name="BLANKMAX" caption="Maximum blank delay" value="0xFFFFF"/>
      </value-group>
      <value-group name="INDEX__SELEP">
        <value name="EP0" caption="Endpoint 0 Select" value="0x0"/>
        <value name="EP1" caption="Endpoint 1 Select" value="0x1"/>
        <value name="EP2" caption="Endpoint 2 Select" value="0x2"/>
        <value name="EP3" caption="Endpoint 3 Select" value="0x3"/>
        <value name="EP4" caption="Endpoint 4 Select" value="0x4"/>
        <value name="EP5" caption="Endpoint 5 Select" value="0x5"/>
        <value name="EP6" caption="Endpoint 6 Select" value="0x6"/>
        <value name="EP7" caption="Endpoint 7 Select" value="0x7"/>
        <value name="EP8" caption="Endpoint 8 Select" value="0x8"/>
      </value-group>
      <value-group name="ENDPOINTX_TXTYPE__PROTOCOL">
        <value name="CONTROL" caption="" value="0x0"/>
        <value name="ISOCHRONOUS" caption="" value="0x1"/>
        <value name="BULK" caption="" value="0x2"/>
        <value name="INTERRUPT" caption="" value="0x3"/>
      </value-group>
      <value-group name="ENDPOINTX_TXTYPE__SPEED">
        <value name="HIGH" caption="Device In High Speed" value="0x1"/>
        <value name="FULL" caption="Device In Full Speed" value="0x2"/>
        <value name="LOW" caption="Device In Low Speed" value="0x3"/>
      </value-group>
      <value-group name="ENDPOINT0_TYPE0__SPEED">
        <value name="HIGH" caption="Device In High Speed" value="0x1"/>
        <value name="FULL" caption="Device In Full Speed" value="0x2"/>
        <value name="LOW" caption="Device In Low Speed" value="0x3"/>
      </value-group>
      <value-group name="ENDPOINTX_RXTYPE__PROTOCOL">
        <value name="CONTROL" caption="" value="0x0"/>
        <value name="ISOCHRONOUS" caption="" value="0x1"/>
        <value name="BULK" caption="" value="0x2"/>
        <value name="INTERRUPT" caption="" value="0x3"/>
      </value-group>
      <value-group name="ENDPOINTX_RXTYPE__SPEED">
        <value name="UNUSED" caption="" value="0x0"/>
        <value name="HIGH" caption="" value="0x1"/>
        <value name="FULL" caption="" value="0x2"/>
        <value name="LOW" caption="" value="0x3"/>
      </value-group>
      <value-group name="DEVCTL__VBUS">
        <value name="BSESSEND" caption="Below SessionEnd" value="0x0"/>
        <value name="ASESSEND" caption="Above SessionEnd, below AValid" value="0x1"/>
        <value name="AAVALID" caption="Above AValid, below VBus Valid" value="0x2"/>
        <value name="AVBUSVALID" caption="Above VBusValid" value="0x3"/>
      </value-group>
      <value-group name="MISC__RXEDMA">
        <value name="MAXP" caption="Dma_req signal for all out endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode." value="0x0"/>
        <value name="MAXP_8" caption="Dma_req signal for all out endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode." value="0x1"/>
      </value-group>
      <value-group name="MISC__TXEDMA">
        <value name="MAXP" caption="Dma_req signal for all in endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode." value="0x0"/>
        <value name="MAXP_8" caption="Dma_req signal for all in endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode." value="0x1"/>
      </value-group>
      <value-group name="TXFIFOSZ__SZ">
        <value name="8BYTES" caption="8 BYTES" value="0x0"/>
        <value name="16BYTES" caption="16 BYTES" value="0x1"/>
        <value name="32BYTES" caption="32 BYTES" value="0x2"/>
        <value name="64BYTES" caption="64 BYTES" value="0x3"/>
        <value name="128BYTES" caption="128 BYTES" value="0x4"/>
        <value name="256BYTES" caption="256 BYTES" value="0x5"/>
        <value name="512BYTES" caption="512 BYTES" value="0x6"/>
        <value name="1024BYTES" caption="1024 BYTES" value="0x7"/>
        <value name="2048BYTES" caption="2048 BYTES" value="0x8"/>
        <value name="4096BYTES" caption="4096 BYTES" value="0x9"/>
      </value-group>
      <value-group name="RXFIFOSZ__SZ">
        <value name="8BYTES" caption="8 BYTES" value="0x0"/>
        <value name="16BYTES" caption="16 BYTES" value="0x1"/>
        <value name="32BYTES" caption="32 BYTES" value="0x2"/>
        <value name="64BYTES" caption="64 BYTES" value="0x3"/>
        <value name="128BYTES" caption="128 BYTES" value="0x4"/>
        <value name="256BYTES" caption="256 BYTES" value="0x5"/>
        <value name="512BYTES" caption="512 BYTES" value="0x6"/>
        <value name="1024BYTES" caption="1024 BYTES" value="0x7"/>
        <value name="2048BYTES" caption="2048 BYTES" value="0x8"/>
        <value name="4096BYTES" caption="4096 BYTES" value="0x9"/>
      </value-group>
      <value-group name="LPMATTR__LINKSTATE">
        <value name="SLEEPSTATE" caption="Sleep State (L1)" value="0x1"/>
      </value-group>
      <value-group name="LPMCNTRL__LPMEN">
        <value name="LPMTRANS" caption="Core supports LPM extended transactions" value="0x0"/>
        <value name="EXTNTRANS" caption="LPM is not supported but extended transactions are supported." value="0x1"/>
        <value name="NOTSUPPORTED1" caption="LPM and extended transactions are not supported" value="0x2"/>
        <value name="NOTSUPPORTED2" caption="LPM and extended transactions are not supported" value="0x3"/>
      </value-group>
      <value-group name="PHY00__PREEMP">
        <value name="SOFEOP" caption="Enable pre-emphasis during SOF and EOP" value="0x0"/>
        <value name="CHIRP" caption="Enable pre-emphasis during chirp" value="0x1"/>
        <value name="NONCHIRP" caption="Enable pre-emphasis in non-chirp state" value="0x2"/>
        <value name="ALWAYS" caption="Always enable pre-emphasis" value="0x3"/>
      </value-group>
      <value-group name="PHY00__SLEWRATE">
        <value name="HIGH" caption="Highest slew rate" value="0x0"/>
        <value name="MIDDLE0" caption="Middle slew rate" value="0x1"/>
        <value name="MIDDLE1" caption="Middle slew rate" value="0x2"/>
        <value name="SMALLEST" caption="Smallest slew rate" value="0x3"/>
      </value-group>
